<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="main_level/agent/main/online/network_0/STEREO_CAMERAS/STEREO_CAMERAS:0" type="Parameter" version="opset1">
			<data shape="1,120,160,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="main_level/agent/main/online/network_0/STEREO_CAMERAS/STEREO_CAMERAS:0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>160</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2029_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_2029" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_431" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_432" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
					<dim>160</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_2010_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 2, 8, 8" offset="34" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_2010" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convolution_24" type="Convolution" version="opset1">
			<data strides="4, 4" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_306_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="8226" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Transpose_306" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_308" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Transpose_310" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_32_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 4, 4" offset="8290" size="65536" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Transpose_32" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convolution_33" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_314_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="73826" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Transpose_314" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Transpose_316" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Transpose_318" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Transpose_41_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="73954" size="73728" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_41" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convolution_42" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_322_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="147682" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Transpose_322" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Transpose_324" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_326" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_325" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="147810" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="main_level/agent/main/online/network_1/STEREO_CAMERAS/BatchnormActivationDropout_5_activation" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/STEREO_CAMERAS/BatchnormActivationDropout_5_activation:0">
					<dim>1</dim>
					<dim>11</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Concat_528" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="147842" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="main_level/agent/main/online/network_1/STEREO_CAMERAS/flatten_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>11</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/STEREO_CAMERAS/flatten_1/Reshape:0">
					<dim>1</dim>
					<dim>11264</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Transpose_1990_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 11264" offset="147858" size="11534336" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>11264</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_1990" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>11264</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>11264</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="main_level/agent/main/online/network_1/middleware_fc_embedder/Dense_0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>11264</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>11264</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/middleware_fc_embedder/Dense_0/MatMul:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_2028_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512" offset="11682194" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_2028" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="main_level/agent/main/online/network_1/middleware_fc_embedder/Dense_0/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/middleware_fc_embedder/Dense_0/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="main_level/agent/main/online/network_1/middleware_fc_embedder/BatchnormActivationDropout_1_activation" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="main_level/agent/main/online/network_1/middleware_fc_embedder/BatchnormActivationDropout_1_activation:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_51" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11683218" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="38" name="Unsqueeze_52" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/StopGradient/input:0,main_level/agent/main/online/network_1/StopGradient:0,main_level/agent/main/online/network_1/mul_1/y:0,main_level/agent/main/online/network_1/mul_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="main_level/agent/main/online/network_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/mul:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="main_level/agent/main/online/network_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/add:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="11683226" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="11683230" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="11683230" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="main_level/agent/main/online/network_1/ppo_head_0/strided_slice/stack_2:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="main_level/agent/main/online/network_1/ppo_head_0/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="main_level/agent/main/online/network_1/ppo_head_0/strided_slice:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Transpose_2001_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 512" offset="11683234" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_2001" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="main_level/agent/main/online/network_1/ppo_head_0/policy_mean/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/ppo_head_0/policy_mean/MatMul:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_2030_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 2" offset="11685282" size="4" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_2030" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="main_level/agent/main/online/network_1/ppo_head_0/policy_mean/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="main_level/agent/main/online/network_1/ppo_head_0/policy:0,main_level/agent/main/online/network_1/ppo_head_0/policy_mean/BiasAdd:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="main_level/agent/main/online/network_1/ppo_head_0/policy:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="32" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1" />
		<edge from-layer="32" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="39" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="40" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="42" from-port="0" to-layer="44" to-port="2" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="3" />
		<edge from-layer="44" from-port="4" to-layer="47" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1" />
		<edge from-layer="47" from-port="2" to-layer="50" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1" />
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.4.0-16579-c3152d32c9c-releases/2024/4" />
		<Runtime_version value="2024.4.0-16579-c3152d32c9c-releases/2024/4" />
		<conversion_parameters>
			<input_model value="DIR\saved_model.pb" />
			<input_shape value="[1,120,160, 2]" />
			<is_python_api_used value="False" />
			<output_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
